Управление_закупками/src/InformationRegisters/РаспределениеПоИсполнителямОМТС/РаспределениеПоИсполнителямОМТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспределениеПоИсполнителямОМТС</name>
  <resources>
    <name>СотрудникОМТС</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныеХарактеристикиНоменклатуры</name>
    <type>
      <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_закупками/src/InformationRegisters/РаспределениеПоИсполнителямОМТС/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура УстановитьОтветственного(Команда)


	Сотрудник = Элементы.СотрудникОМТС;
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено поле Сотрудник ОМТС";
		Сообщение.Поле = "СотрудникОМТС";
		Сообщение.Сообщить();	
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьРегистрСведений();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегистрСведений()
	
	Для Каждого ВыбраннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		МенеджерЗаписи = РегистрыСведений.РаспределениеПоИсполнителямОМТС.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ВнутреннийЗаказ = ВыбраннаяСтрока.ВнутреннийЗаказ;
		МенеджерЗаписи.Номенклатура = ВыбраннаяСтрока.Номенклатура;
		МенеджерЗаписи.ЕдиницаИзмерения = ВыбраннаяСтрока.ЕдиницаИзмерения; 
		МенеджерЗаписи.СотрудникОМТС = Элементы.СотрудникОМТС;
		
		МенеджерЗаписи.Записать();
		
		
		//ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
		////ДанныеСтроки.СотрудникНовый = СотрудникОМТС;	
		//НаборЗаписей = РегистрыСведений.РаспределениеПоИсполнителямОМТС.СоздатьНаборЗаписей(); 	
		//НаборЗаписей.Отбор.ВнутреннийЗаказ.Установить(ДанныеСтроки.ВнутреннийЗаказ);
		//НаборЗаписей.Отбор.Номенклатура.Установить(ДанныеСтроки.Номенклатура);
		//НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(ДанныеСтроки.ЕдиницаИзмерения);
		//
		//НоваяЗапись = НаборЗаписей.Добавить();	
		//НоваяЗапись.ВнутреннийЗаказ = ДанныеСтроки.ВнутреннийЗаказ; 
		//НоваяЗапись.Номенклатура = ДанныеСтроки.Номенклатура; 
		//НоваяЗапись.ЕдиницаИзмерения = ДанныеСтроки.ЕдиницаИзмерения;
		//НоваяЗапись.СотрудникОМТС = Элементы.СотрудникОМТС;		
		
		
	КонецЦикла;
	
КонецПроцедуры
